In [2]:
import pandas as pd

In [3]:
# Create empty dataframe
df = pd.DataFrame()

# Create a column
df['name'] = ['Lauren', 'Glory', 'Mark']
df['gender'] = ['Female', 'Female', 'Male']
df['age'] = [21, 20, 19]

# View dataframe
df

     name  gender  age
0  Lauren  Female   21
1   Glory  Female   20
2    Mark    Male   19

### Create Functions to Process Data

In [4]:
# Create a function that groups the data by a column and returns the mean age per group
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [6]:
# Create a function that capitalizes all the column headers and returns them
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [9]:
mean_age_by_group(df, 'name')

        age
name
Glory    20
Lauren   21
Mark     19

In [14]:
uppercase_column_name(df)

     NAME  GENDER  AGE
0  Lauren  Female   21
1   Glory  Female   20
2    Mark    Male   19

In [15]:
df

     NAME  GENDER  AGE
0  Lauren  Female   21
1   Glory  Female   20
2    Mark    Male   19

### Create A Pipeline Of Those Functions

In [16]:
df.pipe(mean_age_by_group, col='GENDER').pipe(uppercase_column_name)

         AGE
GENDER
Female  20.5
Male    19.0

#### Since we used a group by, the gender column was collapsed and the name column was removed to accomodate this to happen. We can save this change permanently by assigning it to a dataframe.

In [17]:
df

     NAME  GENDER  AGE
0  Lauren  Female   21
1   Glory  Female   20
2    Mark    Male   19

### We can add as many function as we want to this pipeline

In [20]:
# Create a function that returns a datframe with a new column whose value is based on the gender value
def find_gender(dataframe, gender):
    df['is_'+gender] = (df['GENDER'] == gender)
    return df

In [21]:
df = find_gender(df, 'Male')

In [22]:
# Create a function that finds the max value in a column and returns the corresponding row/record
def find_max(dataframe, col):
    record = df.loc[df[col].idxmax()]
    return record

In [24]:
record = find_max(df, 'AGE')

In [25]:
record

NAME       Lauren
GENDER     Female
AGE            21
is_Male     False
Name: 0, dtype: object

#### Note that idxmax returns index labels. So if the DataFrame as duplicates in the index, the label may not uniquely identify the row, so df.loc may return more than one row.
#### Therefore, if df does not have a unique index, you must make the index unique before proceeding as above. Depending on DataFrame, sometimes you can use stack or set_index to make the index unique. Or, you can simply reset the index (so the rows become renumbered, starting at 0):
-- df = df.reset_index()